aa = 1
p a = {
  title: aa == 2 ? "1" : "2"
}

aa = []
10.times do |i|
  a = {
    branch_name: 1,
    branch_number: 1,
    private: i > 4 ? true : false
  }
  aa << a
end
p aa
def 10
22:30 - 23:30 | 22:30 - 24:15 | 修正すべき箇所を調査、修正に取り組む11/22（日）
22:30 - 23:30 | 22:30 - 24:15 | 修正すべき箇所を調査、修正に取り組む11/22（日）
22:30 - 23:30 | 22:30 - 24:15 | 修正すべき箇所を調査、修正に取り組む11/22（日）
22:30 - 23:30 | 22:30 - 24:15 | 修正すべき箇所を調査、修正に取り組む11/22（日）
22:30 - 23:30 | 22:30 - 24:15 | 修正すべき箇所を調査、修正に取り組む11/22（日）
22:30 - 23:30 | 22:30 - 24:15 | 修正すべき箇所を調査、修正に取り組む11/22（日）
22:30 - 23:30 | 22:30 - 24:15 | 修正すべき箇所を調査、修正に取り組む11/22（日）
end
